# BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled Property
ParameterTypeId Class See Also
---
"Segment Bends"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace